"""题目：企业发放的奖金根据利润进行提成，利润小于等于十万元的时候。奖金可提10%；利润高于十万元且低于二十万的
时候，低于十万的部分按10%提成，高于十万的部分可提成7.5%，20到40万之间时，高于二十万的部分可提成5%；40万到
60万之间可提成3%，60 万到100万之间时，高于60万的部分，可提成1.5%，高于100万时，超过100万的部分按1%提成，
从键盘输入当月的利润l.求应发放的奖金总数"""


def bonus(l):
    if l <= 100000:
        b = l * 0.1
    elif l <= 200000:
        b = (l - 100000) * 0.075 + 100000 * 0.1
    elif l <= 400000:
        b = (l - 200000) * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif l <= 600000:
        b = (l - 400000) * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    elif l <= 1000000:
        b = (l - 600000) * 0.015 + 200000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    else:
        b = (l - 1000000) * 0.01 + 400000 * 0.015 + 40000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1
    return b


while True:
    print(bonus(int(input("当月的利润："))))
else:
    None
